Бухгалтерия_обновление_тест1/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <predefined>
    <items>
      <name>УправленческаяОрганизация</name>
      <description>Управленческая организация</description>
    </items>
  </predefined>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОбособленныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйПредприниматель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыСотрудников</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЛоготип</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФаксимильнаяПечать</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКВЕД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОПФГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОПФГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговаяИнспекция</name>
    <type>
      <types>CatalogRef.НалоговыеИнспекции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетДенежныхСредствПоОбособленнымПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеПоУмолчанию</name>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураЗаполненияНалоговыхНаАванс</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьИтоговыеНалоговыеВРозницеСводноПоНоменклатуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураЗаполненияИтоговыхНалоговыхПоРознице</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментОпределенияБазыНДСПоПродажам</name>
    <type>
      <types>EnumRef.МоментыОпределенияНалоговойБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментОпределенияБазыНДСПоЗакупкам</name>
    <type>
      <types>EnumRef.МоментыОпределенияНалоговойБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментОпределенияБазыНДСПоЭкспорту</name>
    <type>
      <types>EnumRef.МоментыОпределенияНалоговойБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаВыпискуНалоговыхДокументов</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияЗвит1С</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФаксимильнаяПодпись</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКОАТУУ</name>
    <comment>Код по КОАТУУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Территория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКФВ</name>
    <comment>Код КФВ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСобственности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСПОДУ</name>
    <comment>Код по СПОДУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганГУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодЗКГНГ</name>
    <comment>Код по ЗКГНГ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отрасль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассПрофессиональногоРиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистрации</name>
    <comment>Номер регистрации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемЗарегистрирована</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистрацииПФ</name>
    <comment>Номер регистрации в ПФ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаПФУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистрацииВСлужбеЗанятости</name>
    <comment>Номер регистрации в службе занятости</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерФСС</name>
    <comment>Номер регистрации ФСС от временной потери трудоспособности</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерФССНесчСлучай</name>
    <comment>Номер регистрации в ФСС от несчастного случая</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеРабочегоОрганаФонда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОДиректораФонда</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганСоциальнойЗащитыНаселения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерФССУ</name>
    <comment>Номер регистрации ФСС Украины</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СворачиватьТоварыВНалоговойНакладной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКАТОТТГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Бухгалтерия_обновление_тест1/src/CommonModules/УчетнаяПолитикаПереопределяемый/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////////
// УчетнаяПолитикаПереопределяемый: переопределяемый механизм отвечающий за получение данных учетной политики.
//  
//////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщиеПараметрыУчетнойПолитики

Функция Существует(Организация, Период, ВыводитьСообщениеОбОтсутствииУчетнойПолитики = Ложь, ДокументСсылка = Неопределено) Экспорт

	Возврат Истина;

КонецФункции

//++ НЕ УТ

// Возвращает признак, является ли организация плательщиком налога на прибыль.
// Параметры:
//	Организация - СправочникСсылка.Организация - организация, для которой определяется необходимость оплаты налога на прибыль;
//	Период - Дата - дата, на начало месяца которой определяется необходимость оплаты налога на прибыль.
//
// Возвращаемое значение:
//	Булево - Истина, если организация на дату является плательщиком налога на прибыль. В противном случае - ложь.
//
Функция ПлательщикНалогаНаПрибыль(Организация, Период) Экспорт
	
	Результат = ПолучитьФункциональнуюОпцию("ПлательщикНалогаНаПрибыль", 
		Новый Структура("Организация, Период", Организация, НачалоМесяца(Период)));
	
	Возврат Результат;
	
КонецФункции 




//-- НЕ УТ

// Возвращает систему налогообложения применяемую организацией.
// Параметры:
//	Организация - СправочникСсылка.Организация - организация, для которой определяется система налогообложения;
//	Период - Дата - дата, на начало месяца которой определяется система налогообложения.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.СистемыНалогообложения - система налогообложения, применяемая для данной организации на указанную дату.
//	Значение по умолчанию: НалогНаПрибыльИНДС
//
Функция СистемаНалогообложения(Организация, Период) Экспорт

	ПараметрыСистемыНалогообложения = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(
        "НастройкиСистемыНалогообложения",
		Организация,
		Период
    );
    Если ПараметрыСистемыНалогообложения <> Неопределено Тогда
        СистемаНалогообложения = ПараметрыСистемыНалогообложения.СистемаНалогообложения;
    Иначе
        СистемаНалогообложения = Перечисления.СистемыНалогообложения.НалогНаПрибыльИНДС; 
    КонецЕсли;    
	Возврат СистемаНалогообложения;

КонецФункции

#КонецОбласти

#Область ПараметрыУчетнойПолитикиПоНДС

// Параметры учетной политики по НДС

// Возвращает признак, является ли организация плательщиком налога на добавленную стоимость (НДС).
// Параметры:
//	Организация - СправочникСсылка.Организация - организация, для которой определяется признак оплаты НДС;
//	Период - Дата - дата, на начало месяца которой определяется необходимость оплаты НДС.
//
// Возвращаемое значение:
//	Булево - Истина, если организация на дату является плательщиком налога на добавленную стоимость. В противном случае - ложь.
//
Функция ПлательщикНДС(Организация, Период) Экспорт

	ПараметрыСистемыНалогообложения = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(
        "НастройкиСистемыНалогообложения",
		Организация,
		Период
    );
    
    ПлательщикНДС = Не ПараметрыСистемыНалогообложения = Неопределено И ПараметрыСистемыНалогообложения.ПлательщикНДС;
    
    Возврат ПлательщикНДС;

КонецФункции 


//++ НЕ УТ
//-- НЕ УТ
#КонецОбласти


//++ НЕ УТ
#Область ПараметрыУчетнойПолитикиБухучет

Функция ИспользуемыеКлассыСчетовРасходов(Организация, Период) Экспорт

	ПараметрыУчетнойПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(
		"УчетнаяПолитикаБухУчета",
		ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация),
		НачалоМесяца(Период),
		Ложь);
		
	Если ЗначениеЗаполнено(ПараметрыУчетнойПолитики) Тогда
		Результат = ПараметрыУчетнойПолитики.ИспользуемыеКлассыСчетовРасходов;
	Иначе 
		Результат = Перечисления.КлассыСчетовРасходов.Класс9;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции 

Функция НалогНаПрибыльБезКорректировокФинансовогоРезультата(Организация, Период) Экспорт

	ПараметрыУчетнойПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(
		"НастройкиУчетаНалогаНаПрибыль",
		ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация),
		НачалоМесяца(Период),
		Ложь);
		
	Если ЗначениеЗаполнено(ПараметрыУчетнойПолитики) Тогда
		Результат = ПараметрыУчетнойПолитики.НалогНаПрибыльБезКорректировокФинансовогоРезультата;
	Иначе 
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ВключатьСуммуДооценокОСВСоставНераспределеннойПрибыли(Организация, Период) Экспорт

	ПараметрыУчетнойПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(
		"УчетнаяПолитикаБухУчета",
		ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация),
		НачалоМесяца(Период),
		Ложь);
		
	Если ЗначениеЗаполнено(ПараметрыУчетнойПолитики) Тогда
		Результат = ПараметрыУчетнойПолитики.ВключатьСуммуДооценокОСВСоставНераспределеннойПрибыли;
	Иначе 
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти
//-- НЕ УТ

//++ НЕ УТ 
//-- НЕ УТ


#Область ПараметрыУчетнойПолитикиПоЕН

// Возвращает признак, является ли организация плательщиком единого налога.
// Параметры:
//	Организация - СправочникСсылка.Организация - организация, для которой определяется признак оплаты НДС;
//	Период - Дата - дата, на начало месяца которой определяется необходимость оплаты НДС.
//
// Возвращаемое значение:
//	Булево - Истина, если организация на дату является плательщиком единого налога. В противном случае - Ложь.
//
Функция ПлательщикЕН(Организация, Период) Экспорт

	ПараметрыСистемыНалогообложения = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(
        "НастройкиСистемыНалогообложения",
		Организация,
		Период
    );
    
    ПлательщикЕН = Не ПараметрыСистемыНалогообложения = Неопределено И ПараметрыСистемыНалогообложения.ПлательщикЕН;
	
    Возврат ПлательщикЕН;

КонецФункции 

#КонецОбласти


//++ НЕ УТ
//-- НЕ УТ

// Определяет, применялся ли для организации признак, указанный в первом параметре, в течении указанного периода.
//
// Параметры:
//	ИмяРесурса - Строка - имя ресурса регистра сведений "УчетныеПолитикиОрганизаций" с типом "Булево";
//	Организация - СправочникСсылка.Организация - организация, для которой определяется значение ресурса;
//	НачалоПериода - Дата - начало периода, для которого определяется значение ресурса;
//	КонецПериода - Дата - конец периода, для которого определяется значение ресурса.
//
// Возвращаемое значение:
//	Булево - Истина, если для организации в течении указанного периода, значение ресурса хотя бы раз принимало значение "Истина". В противном случае - ложь.
//
Функция ЗначенияРесурсаУчетнойПолитикиЗаПериод(ИмяРесурса, Организация, НачалоПериода, ОкончаниеПериода) Экспорт
	
	СледующийМесяц = НачалоМесяца(ДобавитьМесяц(НачалоПериода, 1));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",      Организация);
	Запрос.УстановитьПараметр("НачалоПериода",    НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("СледующийМесяц",   СледующийМесяц);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ОкончаниеПериода));
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения КАК Значение
	|ИЗ
	|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&НачалоПериода, Организация = ВЫРАЗИТЬ(&Организация КАК Справочник.Организации).ГоловнаяОрганизация) КАК НастройкиСистемыНалогообложенияСрезПоследних";
	
	Если СледующийМесяц < КонецМесяца(ОкончаниеПериода) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|"+
		"ВЫБРАТЬ
		|	НастройкиСистемыНалогообложения.СистемаНалогообложения
		|ИЗ
		|	РегистрСведений.НастройкиСистемыНалогообложения КАК НастройкиСистемыНалогообложения
		|ГДЕ
        |	НастройкиСистемыНалогообложения.Организация = &Организация
		|	И НастройкиСистемыНалогообложения.Период МЕЖДУ &СледующийМесяц И &ОкончаниеПериода";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СистемаНалогообложения", ИмяРесурса);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
